{"meta":{"title":"LATTEOTW","subtitle":"","description":"","author":"latteotw","url":"https://latteotw.github.io","root":"/"},"pages":[{"title":"404 Not Found","date":"2020-01-31T03:48:08.829Z","updated":"2020-01-31T03:48:08.829Z","comments":true,"path":"404.html","permalink":"https://latteotw.github.io/404.html","excerpt":"","text":"404 Not Found Sorry the page your are looking for is gone Please make sure you entered the right address"},{"title":"All categories","date":"2020-01-30T08:54:32.875Z","updated":"2020-01-30T08:54:32.875Z","comments":true,"path":"categories/index.html","permalink":"https://latteotw.github.io/categories/index.html","excerpt":"","text":""},{"title":"About","date":"2020-01-30T08:41:27.990Z","updated":"2020-01-30T08:41:27.990Z","comments":true,"path":"about/index.html","permalink":"https://latteotw.github.io/about/index.html","excerpt":"","text":"This is all about me"},{"title":"所有标签","date":"2020-01-30T08:43:15.335Z","updated":"2020-01-30T08:43:15.335Z","comments":true,"path":"tags/index.html","permalink":"https://latteotw.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"How to use this blog","slug":"How-to-use-this-blog","date":"2020-02-03T05:56:58.000Z","updated":"2020-02-03T07:32:17.471Z","comments":true,"path":"2020/02/02/How-to-use-this-blog/","link":"","permalink":"https://latteotw.github.io/2020/02/02/How-to-use-this-blog/","excerpt":"","text":"","categories":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/categories/Misc/"},{"name":"General","slug":"Misc/General","permalink":"https://latteotw.github.io/categories/Misc/General/"}],"tags":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/tags/Misc/"}]},{"title":"Study plan","slug":"Study-plan","date":"2020-02-03T05:56:49.000Z","updated":"2020-02-03T07:33:51.443Z","comments":true,"path":"2020/02/02/Study-plan/","link":"","permalink":"https://latteotw.github.io/2020/02/02/Study-plan/","excerpt":"","text":"We will follow the following order when we practice with Leetcode Arrays Strings Hash table Stack Queue Linked list Tree Graph Math Bit manipulation Recursion Sort Heap Divide and conquer Binary Search BFS DFS Union find Dynamic programming Greedy Backtracking As you can see, we will try to focus on data structures first and then algorithmssince I personally think that data structure are the fundamental for learning moreadvanced algorithms as algorithms are implemented with basic data structures. However,you will find a lot intersections between data structure and algorithms. For example,in order to solve an array problem, you might have to use the knowledge of binarysearch. Therefore, I will try to not include questions that rely on knowledge abouttopics that we have not covered yet. However, I will keep a note on my end to makesure that we re-visit those problems after we cover the topics. After we visit everytopic, all the dots will be connected. There are some topics that I didn’t include in above list because they have less frequenciesthough they are equally important as those problems with higher frequencies. Forexample: Trie, Segment tree, Ordered map and etc. I will still cover these topicsat the time when I think I am ready. I will create a folder(category) and also tag for each of the topics. You can eitherbrowse by category, tag or simply search in the search box.","categories":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/categories/Misc/"},{"name":"General","slug":"Misc/General","permalink":"https://latteotw.github.io/categories/Misc/General/"}],"tags":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/tags/Misc/"}]},{"title":"Knowledge structure graph","slug":"Knowledge-structure-graph","date":"2020-02-03T05:33:39.000Z","updated":"2020-02-03T05:42:12.820Z","comments":true,"path":"2020/02/02/Knowledge-structure-graph/","link":"","permalink":"https://latteotw.github.io/2020/02/02/Knowledge-structure-graph/","excerpt":"","text":"","categories":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/categories/Misc/"},{"name":"General","slug":"Misc/General","permalink":"https://latteotw.github.io/categories/Misc/General/"}],"tags":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/tags/Misc/"}]},{"title":"About this blog","slug":"About-this-blog","date":"2020-01-30T08:46:45.000Z","updated":"2020-02-03T05:22:46.391Z","comments":true,"path":"2020/01/30/About-this-blog/","link":"","permalink":"https://latteotw.github.io/2020/01/30/About-this-blog/","excerpt":"","text":"PurposeI started writing this blog as a memo for my coding interview preparation process.At the mean while, I hope readers can find useful contents in this blog, eitheryou are preparing for coding interview the same as me, or just hoping to sharp yourdata structures and algorithms. Approaches I will use Leetcode as my main source of coding questions and answering templates. I will try to complete selected questions by tags in Leetcode. For each question,they will be approached in a various aspects: Problem set Problem set analysis Thinking process Brutal force / First solution Improvements Answer analysis: time/space complexities Take aways: conclusions, templates, programming related takeaways such as theusage of a given data structure. I will draw a knowledge graph that can represent the structure of all theproblems and their underlying data structure and algorithms that we have processedso that readers can get a general idea of the big picture of data structures and algorithms. Pre-requisites Basic knowledge of Python. We will use Python3 and I will also try to cover somebasic programming knowledge about Python Leetcode access. You can register it for free. Basic knowledge of data structures like array, strings, hashmap and etc. I won’tassume any advanced knowledge of complicated data structure such as tree and graph.Knowledge of algorithms are not required as learning them together is the main purposeof this blog. DiscussionAs I will try my best effort to make my post as accurate as possible, I would alsoappreciate your feedback for any questions and improvements. You can use the discussionsection under each question to interact with me and other readers. Q&amp;A When will I update the blog? I will try to update it on a daily basis but there will for sure be gaps. What’s your practicing order for Leetcode tags? I will post another follow up blog to talk about my plans for practicing withLeetcode. Will system designs be discussed? Yes but it will come after the data structure and algorithms. - latteotw - Nobody said it was easy. No one ever said it would be this hard.","categories":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/categories/Misc/"},{"name":"General","slug":"Misc/General","permalink":"https://latteotw.github.io/categories/Misc/General/"}],"tags":[{"name":"Misc","slug":"Misc","permalink":"https://latteotw.github.io/tags/Misc/"}]}]}